# GetLName

## Description
Function GetLName returns the name of the referenced layer.

```pascal
FUNCTION GetLName(h : HANDLE): STRING;
```

```python
def vs.GetLName(h):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Remarks
Returns the name of the referenced layer.

[sd 8/14/98]

## Examples
olateLayer}}

## Version
Availability: from All Versions

## Category
* Layers